/*****************************************Copyright(C)******************************************
*******************************************浙江方泰*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			: usbmain.h
* Author			: 
* Date First Issued	: 130722   
* Version			: V
* Description		: 
*----------------------------------------历史版本信息-------------------------------------------
* History			:
* //2013		    : V
* Description		: 
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef	__USB_MAIN_H_
#define	__USB_MAIN_H_
/* Includes-----------------------------------------------------------------------------------*/
/* Private define-----------------------------------------------------------------------------*/
#define APP_LOAD_ADDR	0x80000			// nand中app存储位置
#define BOOT_LOAD_ADDR	0x00000			// nand中boot存储位置
/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/
/***********************************************************************************************
* Function		: 
* Description	: 
* Input			: 
* Return		: 
* Note(s)		: 
* Contributor	:130722   wangyao
***********************************************************************************************/
//往U盘里写数据
void WriteWithUSB(void);
//读取U盘里面的数据
void ReadWithUSB(void);
//初始化数据
void InitialiseUSBRxBuff(void);
//U盘生成文件的数据
void CreatfileUSB(void);
//U盘删除文件速度
void unlinkfileUSB(void);
//不关闭文件直接追加着写文件
void WriteWithUSBInSerial();
//生成测试文件
void WriteTestInfo(INT8U Test);
//把时间转化为Char格式输出
void ChangeINTtoChar(INT8U *Ptr);
//从USB进行程序升级
void BOOT_LOAD_FROM_USB(NandInfo_t Nand_InitStructure,INT32U NandAddr,INT16U usBytesRead);
#endif	//__USB_MAIN_H_
/************************(C)COPYRIGHT 2013 浙江方泰*****END OF FILE****************************/
