/*****************************************Copyright(C)******************************************
*******************************************浙江方泰*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName		: guisprint.h
* Author		: 
* Date First Issued	: 130722   
* Version		: V
* Description	: 
*----------------------------------------历史版本信息-------------------------------------------
* History		:
* //2013		: V
* Description	: 
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef	__GUI_SPRINT_H_
#define	__GUI_SPRINT_H_
/* Includes-----------------------------------------------------------------------------------*/
/* Private define-----------------------------------------------------------------------------*/
// sprint函数相关定义
#define	BSPGUI_SPRINT_DISP_NUM	15	// print函数一个数据的最大显示位数
/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
extern tContext sContext;//文本
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/
/***********************************************************************************************
* Function	: BSP_GUIDispChars
* Description	: 从起始位置开始显示半角字符串
* Input		: x0:
		  y0:
	          len:数据长度
                  *pData:数据指针
* Output	: TRUE/FALSE
* Note(s)	: 这里传递的数据是ASCII码表,不是字库数据指针
* Contributor	: 10/12/2010	wangyao
***********************************************************************************************/
INT16U BSP_GUIDispChars(INT16U x0,INT16U y0,INT16U len,INT8U *pData);
/***********************************************************************************************
* Function	: BSP_GUISprint
* Description	: 显示一个数字(有点类似sprinf函数,简化了许多)
* Input		: x0:x起始坐标(0 ~ BSPGUI_XSIZE-1)
                     y0:y起始坐标(0 ~ BSPGUI_YSIZE-1)
                      *p:控制参数,用来表明显示格式的,有点类似标准库函数printf()的参数用法
                            *p="u.vwx",由以下几部分组成
                                    第一部分'u'字符是表明显示的位数,1~BSPGUI_SPRINT_DISP_NUM,可以两位('12')也可以一位('6')
                                    第二部分'.v'字符是表明小数点位数,如果没有则表明是整数
                                    第三部分'w'字符是显示类型控制
                                            'd':带符号十进制(正的不显示符号,负的显示'-'),最大显示位数10
                                            'u':无符号十进制,最大显示位数10
                                            'p':带小数点的大写的十六进制数(其实是BCD码显示),如果出现大于9的字符,则全部显示'-',小数点保留
                                            'x':小写的十六进制
                                            'X':大写的十六进制
                                            'f':浮点数(没做)
                                    第四部分'x'字符用于一些特殊功能
                                            'Z':显示高位的0
                                            'L':去除高位的0,并且数字往左靠
                                            无:高位的0不显示,但是位置保留
                                    注:小数点占一个位置
                      *pData:数据,类型(INT8U *),对于十进制数,必须先转换成INT32,再传递,并且最大显示位数为10
                      例子:
                            1 无符号十进制
                                    INT8U data = 0x12;
                                    INT32U temp;
                                    temp = (INT32U)data;
                                    BSP_GUISprint(x0,y0,"2u",(INT8U *)temp);
                                    显示:"18";返回:2
                            2 有符号十进制
                                    INT8U data = -1;
                                    INT32S temp;
                                    temp = (INT32S)data;
                                    BSP_GUISprint(x0,y0,"3d",(INT8U *)&temp);
                                    显示:" -1";返回:3
                            3 十六进制
                                    INT16U data = 0x0123;
                                    BSP_GUISprint(x0,y0,"4x",(INT8U *)&data);
                                    显示:" 123";返回:4
                                    BSP_GUISprint(x0,y0,"4xL",(INT8U *)&data);
                                    显示:"123";返回:3
                                    BSP_GUISprint(x0,y0,"4xZ",(INT8U *)&data);
                                    显示:"0123";返回:4
                            4 带小数点的十六进制
                                    INT16U data = 0x0123;
                                    BSP_GUISprint(x0,y0,"3.1p",(INT8U *)&data);
                                    显示:" 12.3";返回:5
                                    BSP_GUISprint(x0,y0,"1.3p",(INT8U *)&data);
                                    显示:"0.003";返回:5
                                    BSP_GUISprint(x0,y0,"5.7p",(INT8U *)&data);
                                    显示:"0.0000123";返回:9
                                    BSP_GUISprint(x0,y0,"2.4p",(INT8U *)&data);
                                    显示:"0.0023";返回:6
* Output	: 实际显示的长度
* Note(s)	: 
* Contributor	: 081205  wangyao	
***********************************************************************************************/
INT8U BSP_GUISprint(INT16U x0,INT16U y0,const tFont *pFont,INT8U *p,INT8U *pData);
/***********************************************************************************************
* Function		: GUIPrintf
* Description	: 显示字符串函数,用法基本同标准printf函数,只是前面多了x,y坐标
* Input			: x0:x起始坐标(0 ~ BSPGUI_XSIZE-1)
				  y0:y起始坐标(0 ~ BSPGUI_YSIZE-1)
				  *pStr,...:用法同标准printf函数
* Output		: 实际显示的数据长度,0:出错
* Note(s)		: 
* Contributor	: 131211	wangyao
***********************************************************************************************/
INT16U GUIPrintf(INT16U x0,INT16U y0,const char *pStr,...);
/***********************************************************************************************
* Function		: BSP_GUIFill
* Description	: LCD区域填充
* Input			: x0:x起始坐标
				  y0:y起始坐标
				  x1:x结束坐标
				  y1:y结束坐标
				  color:需要填充的数据
* Output		: 
* Note(s)		: 调用grlib的tRectangle制作该函数。
* Contributor	: 140221	wangyao
***********************************************************************************************/
void BSP_GUIFill(INT16U x0,INT16U y0,INT16U x1,INT16U y1,INT32U color);
#endif	//__GUI_SPRINT_H_
/************************(C)COPYRIGHT 2013 浙江方泰*****END OF FILE****************************/