/*****************************************Copyright(C)******************************************
*******************************************浙江方泰*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			: flashinterface.h
* Author			: 
* Date First Issued	: 130722   
* Version			: V
* Description		: 
*----------------------------------------历史版本信息-------------------------------------------
* History			: 
* //2013	        : V
* Description		: 
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
/* Includes-----------------------------------------------------------------------------------*/

/* Private define-----------------------------------------------------------------------------*/
#define READ_ORDER  0x00
#define WRITE_ORDER 0x01


#define PARATABLELEN     62     //终端参数表长度，也即测量点0参数表长度
#define DATATABLELEN     59     //测量点数据表长度

/* Private macro------------------------------------------------------------------------------*/

/* Private function prototypes----------------------------------------------------------------*/


/***********************************************************************************************
* Function		: ProtocolATOperation
* Description	: 按数据ID,对参数的存和读flash函数统一接口
* Input			: controlstrcut--入参传递控制结构体
* Output		: 
* Note(s)		: 
* Contributor	: 10/12/2010	wangyao
***********************************************************************************************/
INT16U ProtocolATOperation(InterfaceStruct *terminal_para);    
/***********************************************************************************************
* Function		: ParaAppfunction
* Description	: 供flash任务包外的task
* Input			: terminal_para->RWChoose//读写功能
				  terminal_para->DataID  //数据ID
				  terminal_para->len     //数据长度
				  terminal_para->offset  //在表格中的偏移量
				  terminal_para->*ptr    //具体数据
* Output		: 
* Note(s)		: 
* Contributor	: 10/12/2010	wangyao
***********************************************************************************************/
INT16U ParaAppfunction(InterfaceStruct *terminal_para);
/************************(C)COPYRIGHT 2014 浙江方泰*****END OF FILE****************************/


