/*****************************************Copyright(C)******************************************
*******************************************浙江方泰*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			: version.h
* Author			: Simon
* Date First Issued	: 01/16/2015
* Version			: V
* Description		:
*----------------------------------------历史版本信息-------------------------------------------
* History			:
* //2010		: V
* Description		:
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef __VERSION_H_
#define __VERSION_H_
//This verion control module follow Fota Version1.1
//detail define in: http://192.168.15.124/mediawiki/index.php/%E7%A8%8B%E5%BA%8F%E7%89%88%E6%9C%AC%E8%A7%84%E8%8C%83

//$m%FOTA^*+*@  //固定头，12字节+后加25
//$m%FOTA^*+*@$(机器型号4位).$(模块型号3位)$(模块版本号2位).$(OS_TYPE/保留/2位)$(网发1位).$(发布年月4位),$(主版本2位).$(次版本2位)



#if FZ1500
#define APP_VER     "$m%FOTA^*+*@F400.UMB01.U81.1501.00.13"
#else
#define APP_VER     "$m%FOTA^*+*@F100.UMB01.U81.1501.00.06"
#endif

extern void getVersion(char* str_ver);




#endif
/************************(C)COPYRIGHT 2013 浙江方泰*****END OF FILE****************************/
