							Linux网络配置信息存在几个不同的文件里面
/********************************************************************************************************																   	*	
	1. /etc/sysconfig/network	-	设置基本的网络配置，作用于整个系统，重启生效                    	*
		NETWORKING=yes/no	- 是否开启网络																*
		HOSTNAME=code		- 主机名																	*
		GATEWAY=192.168.1.1	- 网关																		*
																										*
		备注：/etc/sysconfig/network-scripts/ifcfg-eth中也设置了网关时，以ifcfg-eth中为准				*
																										*
	2. /etc/sysconfig/network-scripts/ifcfg-eth	-	网卡的配置文件，作用于具体的那张网卡，重启生效		*
		DEVICE=eth0					- 网卡设备名称														*
		ONBOOT=yes					- 系统启动时网卡是否激活											*
		BOOTPROTO=static/dhcp		- IP的配置方法														*
		IPADDR=192.168.1.3			- IP（static时有效）												*
		GATEWAY=192.168.1.1			- 网关																*
		NETMASK=255.255.255.0		- 子网掩码															*
		HWADDR=00:0C:29:FE:1A:09	- MAC																*
		TYPE=Ethernet				- 网络类型															*
		DNS1=114.114.114.114		- DNS1																*
		DNS2=8.8.8.8				- DNS2																*
																										*
		备注：/etc/resolv.conf文件只能显示当前配置的DNS信息，DNS的修改必须在ifcfg-eth中完成				*
********************************************************************************************************/

							网络相关基本命令
/********************************************************************************************************	
	1. service network 	start	-	启动
						restart	-	重启
						stop	- 	关闭
						reload	-	重启
						status	-	状态
	
	2. ifconfig								- 	不带参数时，用于显示当前网络设备信息
				-a							-	显示当前全部网卡的信息，该命令可以用来查看有多少张网卡，以及网卡名ethx
				eth0 inet 192.168.1.3		- 	临时修改IP，inet选项可不省略
				eth0 netmask 255.255.255.0	- 	临时修改子网掩码
				eth0 mtu 1500				-	临时修改最大传输单元
				eth0 up/down				- 	开启/关闭网卡
				
********************************************************************************************************/	